/* 날짜 : 2012년 2월 1일   
   작성자 : 이로운   
   프로그램의 기능 : 278970원을 50000원, 10000원, 5000원, 1000원, 500원, 100원, 50원, 10원권 단위로 환산하여 각각의 개수를 출력하기	*/
#include <stdio.h>
int main()
{
	int money = 278970;		// 278970원
	int m50000, m10000, m5000, m1000, m500, m100, m50, m10; // 50000원, 10000원, 5000원, 1000원, 500원, 100원, 50원, 10원권 환산 개수가 저장될 변수

	m50000 = money / 50000;
	printf("50000원권 => %d개\n", m50000);	//출력
	money = money - m50000 * 50000;

	m10000 = money / 10000;
	printf("10000원권 => %d개\n", m10000);	//출력
	money = money - m10000 * 10000;

	m5000 = money / 5000;
	printf("5000원권 => %d개\n", m5000);		//출력
	money = money - m5000 * 5000;

	m1000 = money / 1000;
	printf("1000원권 => %d개\n", m1000);		//출력
	money = money - m1000 * 1000;

	m500 = money / 500;
	printf("500원권 => %d개\n", m500);		//출력
	money = money - m500 * 500;

	m100 = money / 100;
	printf("100원권 => %d개\n", m100);		//출력
	money = money - m100 * 100;

	m50 = money / 50;
	printf("50원권 => %d개\n", m50);			//출력
	money = money - m50 * 50;

	m10 = money / 10;
	printf("10원권 => %d개\n", m10);			//출력	

	return 0;
}